[
    {
        "Day": 0,
        "Dtail": ">\"ไถดะ\" ไถครั้งแรกตามแนวยาวของพื้นที่นา การไถดะจะช่วยพลิกดินเพื่อให้ดินชั้นล่างได้ขึ้นมาสัมผัสอากาศรับออกซิเจน \nและเป็นการตากดินเพื่อทำ ลายวัชพืช โรคพืชบางชนิด",
        "Rec": ">ดินควรอยู่ในลักษณะชื้นและอ่อนเพื่อความสะดวกในการไถ\n>หลังจากกาไถควรทิ้งดินไว้ให้แห้ง(ถ้ามีการนำน้ำเข้านาก่อนการไถต้องระบายน้ำออกเมื่อไถเสร็จ)",
        "Step": ">เตรียมหน้าดิน\n(ครั้งที่ 1)",
        "Warn": "ถ้าดินเปียกน้ำเป็นระยะเวลานานโดยไม่มีโอกาสได้แห้ง \nจะเกิดการสะสมของสารพิษ เช่นแก๊สไข่เน่าฃและกรดอินทรีย์ เป็นต้น ซึ่งถ้าสารเหล่านี้มีปริมาณมากก็จะเป็นอันตรายต่อรากข้าวได้"
    },
    {
        "Day": 7,
        "Dtail": "ทำหลังจากทำการไถดะ และตากดินไว้ประมาณ 1 - 2 สัปดาห์แล้ว จึงทำการการไถแปร \nโดยการไถในครั้งนี้จะช่วยพลิกเอาดินที่กลบไว้ขึ้นมาอีกครั้ง เพื่อทำลายวัชพืชที่ขึ้นใหม่และเป็นการย่อยดินให้มีขนาดเล็กลง",
        "Rec": ">ดินควรอยู่ในลักษณะชื้นและอ่อนเพื่อความสะดวกในการไถ\n>หลังจากการไถควรทิ้งวัชพืชต่าง ๆไว้ประมาณ 2 สัปดาห์ เพื่อให้สามารถย่อยสลายได้สมบูรณ์",
        "Step": "เตรียมหน้าดิน\n(ครั้งที่2)",
        "Warn": ">ปล่อยน้ำออกจากแปลงให้เหลือไม่น้อยกว่าประมาณ 1 ฝ่ามือ"
    },
    {
        "Day": 14,
        "Dtail": "“การไถคราด” เป็นการกำจัดวัชพืช ตลอดจนการทำให้ดินแตกตัว \nและเป็นเทือกพร้อมสำหรับการหว่านเมล็ด",
        "Rec": "> ควรไถคราดซ้ำไปมาหลาย ๆ รอบ เพื่อให้ดินแตกตัว",
        "Step": "เตรียมหน้าดิน\n(ครั้งที่3)",
        "Warn": "> -"
    },
    {
        "Day": 15,
        "Dtail": null,
        "Rec": null,
        "Step": ">นำน้ำเข้านา",
        "Warn": ">ระดับน้ำไม่น้อยกว่า 3 ซม. และไม่เกิน 10 ซม."
    },
    {
        "Day": 16,
        "Dtail": "คัดเมล็ดพันธุ์ให้ได้เมล็ดที่แข็งแรง มีน้ำหนักเมล็ดดีที่เรียกว่าข้าวเต็มเมล็ด จะได้ต้นข้าวที่เจริญเติบโตแข็งแรงแช่ข้าวเพื่อให้เมล็ดมีรากงอกออกมาเพื่อเตรียมพร้อมสำหรับการหว่าน\nอัตราเมล็ดพันธุ์\n7-8 กิโลกรัมหรือ 1 ถังต่อไร่",
        "Rec": "ตรวจความบริสุทธิ์ของเมล็ดพันธุ์ พิจารณาว่ามีเมล็ดข้าวพันธุ์อื่นหรือเมล็ดวัชพืชปนหรือไม่ ไม่มีโรคหรือแมลงทำลาย รูปร่างเมล็ดมีความสม่ำเสมอ",
        "Step": "การเตรียมเมล็ดพันธุ์",
        "Warn": "ถ้าพบว่าเมล็ดข้าวมีเมล็ดวัชพืชปน หรือมีโรคแมลงก็ไม่ควรนำมาใช้ทำพันธุ์"
    },
    {
        "Day": 17,
        "Dtail": "ควรหว่านให้สม่ำเสมอทั่วแปลง ข้าวจะได้รับธาตุอาหาร แสงแดด และเจริญเติบโตสม่ำเสมอกัน ทำให้ได้ผลผลิตสูง โดยเดินหว่านในร่องแคบๆ ที่ทำไว้ เมล็ดพันธุ์ที่ใช้หว่านแต่ละแปลงย่อย ควรแบ่งออกเป็นส่วนๆ ตามขนาดและจำนวนแปลงย่อย เพื่อเมล็ดข้าวที่หว่านลงไปจะได้สม่ำเสมอทั่วทั้งแปลง ในกักน้ำไว้หนึ่งคืนแล้วจึงระบายออก จะทำให้ข้าวงอกและจับดินดี",
        "Rec": "ข้อระวัง\nนาที่เป็นดินทรายมีตะกอนน้อยหลังจากทำเทือกแล้วควรหว่านทันที",
        "Step": "หว่านข้าว",
        "Warn": "ข้อระวัง\nนาที่เป็นดินทรายมีตะกอนน้อยหลังจากทำเทือกแล้วควรหว่านทันที"
    },
    {
        "Day": 27,
        "Dtail": "ใบจุดสีน้ำตาล,โรคใบสีส้ม,โรคโรคไหม้,โรคใบหงิก,เพลี้ยกระโดดสีน้ำตาล,เพลี้ยจักจั่นสีเขียว,หนอนกอข้าว",
        "Rec": "เลือกใช้สารป้องกันที่ตรงกับโรคและแมลงที่",
        "Step": "ระวังแมลงและโรคข้าว",
        "Warn": "ไม่ใช้สารป้องกันมากเกินไปและไม่นำสารป้องกันมาผสมกัน"
    },
    {
        "Day": 37,
        "Dtail": null,
        "Rec": "ข้อแนะนำในการนำน้ำออกจากแปลงกล้า\n* -",
        "Step": "นำน้ำออกจากแปลงกล้า",
        "Warn": "ข้อควรระวัง\n* -"
    },
    {
        "Day": 40,
        "Dtail": "*",
        "Rec": "ข้อแนะนำในการถอนต้นกล้า\n* ควรเอากล้าไปแช่น้ำ",
        "Step": "ถอนต้นกล้า",
        "Warn": "ข้อควรระวัง\n>ระวังไม่ให้รากกล้าขาด"
    },
    {
        "Day": 50,
        "Dtail": "*",
        "Rec": "*ควรนำน้ำเข้านาไม่เกิน15ซม.และไม่น้อยกว่า10ชม.",
        "Step": "นำน้ำเข้าแปลงข้าว",
        "Warn": "ข้อควรระวังในการนำน้ำเข้านาครั้งที่1.\n*ควรนำน้ำเข้านาไม่เกิน15ซม.และไม่น้อยกว่า5ซม."
    },
    {
        "Day": 90,
        "Dtail": null,
        "Rec": "ข้อแนะนำ\n*-",
        "Step": "นำน้ำออกจากแปลงกล้าครั้งที่",
        "Warn": "ข้อควรระวัง\n* _"
    },
    {
        "Day": 100,
        "Dtail": null,
        "Rec": "ข้อแนะนำ\n*-",
        "Step": "สำรวจและกำจัดวัชพืชก่อนใส่ปุ๊ย",
        "Warn": "ข้อควรระวัง\n* ถ้าเจอแมลงวัชพืชให้รีบกำจัด"
    },
    {
        "Day": 110,
        "Dtail": null,
        "Rec": "สูตรปุ๋ยที่แนะนำ\n* ประเภทดินเหนียว ได้แก่ 16-20-0 หรือ 18-22-0 หรือ 20-20-0 \n* ประเภทดินร่วนและดินทราย ได้แก่  16-16-8 หรือ 18-12-6 หรือ 15-15-15",
        "Step": "ใส่ปุ๋ยครั้งที่ 1\n* อัตราการใส่ปุ๋ย 20-25 (กก./ไร่)",
        "Warn": "ไม่ควรใส่ปุ๊ยเยอะเกิน"
    },
    {
        "Day": 111,
        "Dtail": null,
        "Rec": "ข้อแนะนำ\n*-",
        "Step": "สำรวจและกำจัดวัชพืชก่อนใส่ปุ๊ย",
        "Warn": "ข้อควรระวัง\n* ถ้าเจอแมลงวัชพืชให้รีบกำจัด"
    },
    {
        "Day": 112,
        "Dtail": "* ระยะเวลาที่ระยะกำเนิดช่อดอก (ประมาณ 25 – 30 วันก่อนข้าวออกดอก) หรือใส่หลังใส่ปุ๋ยครั้งแรกแล้ว 30 วัน\nชนิดของปุ๋ยและอัตราการใส่ปุ๋ยครั้งที่ 2 แนะนำ\n* ประเภทดินเหนียว ได้แก่ แอมโมเนียมซัลเฟต 10-20 (กก./ไร่)\n  หรือยูเรีย 5-10 (กก./ไร่) หรือปุ๋ยสูตรต่างๆ** 20-25 (กก./ไร่)\n* ประเภทดินร่วนและดินทราย ได้แก่ แอมโมเนียมซัลเฟต 10-20 (กก./ไร่)\n  หรือยูเรีย 5-10 (กก./ไร่) หรือปุ๋ยสูตรต่างๆ** 20-25 (กก./ไร่)",
        "Rec": "*",
        "Step": "ใส่ปุ๋ยครั้งที่ 2.",
        "Warn": "ข้อระวัง\n*  การใส่ปุ๋ยแต่ละครั้งให้เลือกใช้ปุ๋ยเพียงสูตรเดียวเท่านั้น\n* ต้องเป็นสูตรปุ๋ยที่มี N อยู่ในรูป NH4+-N\n** ในกรณีที่ไม่สามารถหาปุ๋ยไนโตรเจนอื่น เช่น แอมโมเนียมซัลเฟต หรือยูเรียได้ก็ให้ใช้ปุ๋ยเชิงประกอบ หรือปุ๋ยเชิงผสมสูตรที่ใส่ครั้งที่ 1 แทนในอัตราเท่ากัน"
    },
    {
        "Day": 113,
        "Dtail": "ก่อนถึงวันเก็บเกี่ยว 10 วัน\nให้ระบายน้ำออกจากนาให้หมด เพื่อให้ข้าวสุกแก่สม่ำเสมอ แปลงนาที่แห้งจะสะดวกในการลงไปทำงาน ทั้งการเก็บเกี่ยวด้วยแรงงานคน และเครื่องจักร\nกำหนดวันที่เก็บเกี่ยว",
        "Rec": null,
        "Step": "เตรียมตัวเก็บเกี่ยว\nวางการเก็บเกี่ยวอุปกรณ์และแรงงาน",
        "Warn": "การพยากรณ์อากาศได้ หากคาดว่าจะมีฝนตกในช่วงวันเก็บเกี่ยว อาจทำการเก็บเกี่ยวก่อน หรือหลังวันที่กำหนดได้ แต่ควรมีแผนการขนย้ายผลผลิต หรือการเก็บผลผลิตไว้ในยุ้งฉาง ในสภาพที่แห้ง"
    }
]