BEGIN TRANSACTION;
CREATE TABLE IF NOT EXISTS "RiceRec" (
	"ID"	TEXT,
	"Name"	TEXT,
	"Solid_Mold"	INTEGER,
	"Solid_Cray"	INTEGER,
	"Solid_Sandy"	INTEGER,
	"Irrigation"	INTEGER,
	"Reservoir"	INTEGER,
	"Nope"	TEXT,
	"Zone"	TEXT,
	"Description"	TEXT
);
INSERT INTO "RiceRec" VALUES ('R1','ข้าวดอกมะลิ 105',1,1,1,0,0,'1','N,NE','เป็นข้าวเจ้า มีช่วงเก็บเกี่ยวในเดือนพฤศจิกายน ผลผลิตเฉลี่ย 363 กิโลกรัมต่อไร่ อมิโลสต่ำ ข้าวสุกนุ่มหอม เมล็ดมีระยะพักตัว 8 สัปดาห์ ทนแล้งได้ดีพอสมควร  ทนดินเปรี้ยวและดินเค็ม');
INSERT INTO "RiceRec" VALUES ('R2','ขาวตาแห้ง 17',1,1,0,0,0,'1','N,C','เป็นข้าวเจ้า สูงประมาณ 150 เซนติเมตร ไวต่อช่วงแสง  ลําต้นสีเขียวกอแผ่กระจายเมล็ดข้าวมีรูปร่างเรียวยาวข้าวเปลือกสีฟาง ระยะพักตัวของเมล็ด  ประมาณ 8 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R3','กข. 5',1,1,0,1,1,'0','A','เป็นข้าวเจ้าต้นสูง สูงประมาณ 145 เซนติเมตร เป็นพันธุ์ข้าวไวต่อช่วงแสงเล็กน้อย เหมาะทีจะปลูกเป็นข้าวนาปีลําต้นสีม่วงมีรวงยาวต้นแข็งไม่ล้มง่ายระยะพักตัวของเมล็ด  ประมาณ 6 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R4','กข. 13',1,1,1,0,0,'1','S','เป็นข้าวเจ้า สูงประมาณ 160 เซนติเมตร ไวต่อช่วงแสง ลําต้นตังตรง สีเขียว ใบธงตก\n ชูรวงอยู่เหนือใบระแง้ถี เมล็ดข้าวเปลือกสีนําตาล ระยะพักตัวของเมล็ด ประมาณ 3 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R5','เหลืองประทิว 123',1,1,0,1,0,'0','C','เป็นข้าวเจ้า สูงประมาณ 150 เซนติเมตร ไวต่อช่วงแสง ลําต้นและใบสีเขียวกว้างและยาว คอรวงยาว ข้าวเปลือกสีเหลืองยาวเรียวระยะพักตัวของเมล็ด ประมาณ 3 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R6','นางมล เอส-4',1,1,0,1,0,'0','C','เป็นข้าวเจ้า สูงประมาณ 140 เซนติเมตร ไวต่อช่วงแสง ลําต้นสีเขียวใบกว้าง รวงใหญ่และยาว เมล็ดรูปร่างยาวเรียว ข้าวเปลือกสีฟาง ระยะพักตัวของเมล็ด \n ประมาณ 5 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R7','ข้าวเจ้าหอมพิษณุโลก 1',1,1,0,0,0,'1','N,C','เป็นข้าวเจ้า สูงประมาณ 160 เซนติเมตร ไวต่อช่วงแสง ลําต้นสูง ทรงกอตังฟางแข็งปานกลาง ใบสีเขียวธงเอน คอรวงยาว รวงแน่นปานกลาง ระแง้ถี เมล็ดข้าวเปลือกสีฟาง');
INSERT INTO "RiceRec" VALUES ('R8','กข. 3',1,1,0,1,1,'0','A','เป็นข้าวเจ้า สูงประมาณ 100 เซนติเมตร ไม่ไวต่อช่วงแสง ลําต้นและใบสีเขียว เมล็ดเรียวยาว เมล็ดข้าวเปลือกสีนํ้าตาล ระยะพักตัวของเมล็ดประมาณ 3 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R9','กข. 7',1,1,0,1,1,'0','A','เป็นข้าวเจ้า สูงประมาณ 115 เซนติเมตร ไม่ไวต่อช่วงแสง เมล็ดข้าวเปลือกสีฟาง ท้องไข่น้อย ระยะพักตัวของเมล็ดประมาณ 1 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R10','กข. 29',1,1,0,1,1,'0','N,C','เป็นข้าวเจ้า ไม่ไวต่อช่วงแสง ทรงกอตั้งต้นแข็งไม่ล้มง่าย ใบสีเขียวเข้มตั้งตรง รวงแน่นปานกลาง คอรวงยาว เมล็ดข้าวเปลือกสีฟาง ระยะพักตัวของเมล็ดพันธุ์ประมาณ 4-6 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R11','กข. 33',1,1,0,1,1,'1','N,NE','เป็นข้าวเจ้าไม่ไวต่อช่วงแสง ทรงกอตั้งต้นค่อนข้างแข็ง ใบสีเขียวหักลง รวงแน่นปานกลาง คอรวงยาว เมล็ดข้าวเปลือกสีฟาง ข้าวกล้องสีขาวรูปร่างเรียว ระยะพักตัวของเมล็ดพันธุ์ประมาณ 8 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R12','กข. 43',1,1,0,1,1,'0','A','เป็นข้าวเจ้าไม่ไวต่อช่วงแสง สูงประมาณ 103 เซนติเมตร ทรงกอตั้ง ต้นค่อนข้างแข็ง ใบสีเขียวจางเอนปานกลาง เมล็ดข้าวเปลือกสีฟาง ข้าวกล้องสีขาวรูปร่างเรียว');
INSERT INTO "RiceRec" VALUES ('R13','กข. 47',1,1,0,1,1,'0','N','เป็นข้าวเจ้า สูงประมาณ 90-100 เซนติเมตร ไม่ไวต่อช่วงแสง ลําต้นแข็งมาก ใบสีเขียว มุมใบธงกว้างปานกลาง รวงยาว เมล็ดข้าวเปลือกสีฟาง');
INSERT INTO "RiceRec" VALUES ('R14','กข. 55',1,1,0,1,1,'0','S','เป็นข้าวเจ้าไม่ไวต่อช่วงแสงให้ผลผลิตเฉลี่ยในศูนย์วิจัยข้าวซึ่งปลูกโดยวิธีปักดำ ต้นแข็งไม่ล้มง่าย ใบธงตั้ง ความสูงของต้น 91 เซนติเมตรค่อนข้างต้านทานต่อโรคไหม้และโรคขอบใบแห้ง และอ่อนแอต่อเพลี้ยกระโดดสีน้ำตาล');
INSERT INTO "RiceRec" VALUES ('R15','กข. 29',1,1,1,1,1,'0','N,C','เป็นข้าวเจ้าไม่ไวต่อช่วงแสงอายุเก็บเกี่ยว 99 วันในฤดูนาปรัง และ 103 วัน ในฤดูนาปีทรงกอตั้ง ต้นแข็งไม่ล้มง่าย ใบสีเขียวเข้ม ใบธงตั้งตรง รวงแน่นปานกลาง คอรวงยาวเมล็ดข้าวเปลือกสีฟาง');
INSERT INTO "RiceRec" VALUES ('R16','กข. 3',0,1,1,0,0,'1','A','เป็นข้าวเจ้า สูงประมาณ 100 เซนติเมตรไม่ไวต่อช่วงแสงลำต้นและใบสีเขียว เมล็ดเรียวยาวเมล็ดข้าวเปลือกสีน้ำตาล');
INSERT INTO "RiceRec" VALUES ('R17','กข. 7',1,1,0,0,0,'1','C,S','เป็นข้าวเจ้า สูงประมาณ 115 เซนติเมตรเป็นข้าวเจ้า สูงประมาณ 115 เซนติเมตรอายุเก็บเกี่ยวประมาณ 125 วันเมล็ดข้าวเปลือกสีฟางระยะพักตัวของเมล็ดประมาณ 1 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R18','กข. 6',0,1,1,0,1,'0','N,NE','เป็นข้าวเหนียว สูงประมาณ 154 เซนติเมตรไวต่อช่วงแสงทรงกอกระจายเล็กน้อย ใบยาวสีเขียวเข้ม ใบธงตั้ง เมล็ดยาวเรียเมล็ดข้าวเปลือกสีน้ำตาล');
INSERT INTO "RiceRec" VALUES ('R15','เหนียวดำหมอ 37',1,1,1,1,1,'0','S','เป็นข้าวทีมีคุณค่าทางโภชนาการสูงซึงพบ ว่าข้าวกล้องและข้าวกล้องงอกมีสารออกฤทธิทางชีวภาพโดยมีธาตุแคลเซียม ธาตุเหล็ก ธาตุสังกะสีและสารในกลุ่มวิตามินอีแอลฟาโทโคฟีรอลสูง มีวิตามินบี 1วิตามินบี 3 และวิตามินบี 6');
INSERT INTO "RiceRec" VALUES ('R19','เขี้ยวงู',0,0,0,0,0,'0','N','เป็นข้าวเหนียว สูงประมาณ 154 ซม. ไวต่อช่วงแสง ทรงกอกระจายเล็กน้อย ใบยาวสีเขียวเข้มเมล็ดยาวเรียว เมล็ดข้าวเปลือกสีนําตาล ระยะพักตัวของเมล็ดประมาณ 5 สัปดาห์');
INSERT INTO "RiceRec" VALUES ('R20','เหนียวอุบล 1',0,0,1,0,0,'1','NE','เป็นข้าวเหนียว สูงประมาณ 145 เซนติเมตรไวต่อช่วงแสงอายุเก็บเกี่ยว ประมาณกลางเดือนพฤศจิกายนทรงกอตั้งตรง แตกกอดี ต้นและใบสีเขียวเข้ม ใบธงตั้ง เมล็ดยาวเรียว');
INSERT INTO "RiceRec" VALUES ('R22','เหนียวอุบล 2',1,0,1,0,0,'1','NE','เป็นพันธุ์ข้าวเหนียว สูงประมาณ 118 เซนติเมตรไวต่อช่วงแสงทรงกอแผ่ ต้นแข็ง ใบสีเขียวเข้ม กาบใบสี เขียว ใบธงตั้งตรง รวงแน่นปานกลาง คอรวงสั้นเมล็ดข้าวเปลือกสีน้ำตาล');
INSERT INTO "RiceRec" VALUES ('R23','เหนียวดำช่อไม้ไผ่',0,0,1,1,0,'0','S','เป็นข้าวเหนียวดำพันธุ์พื้นเมืองสูงประมาณ 135 เซนติเมตรทรงกอตั้ง เมล็ดข้าวเปลือกสีฟาง');
INSERT INTO "RiceRec" VALUES ('R24','กำผาย 15',1,1,1,0,0,'1','N','เป็นข้าวเหนียวต้นสูง สูงประมาณ 168 เซนติเมตรไวต่อช่วงแสงไวต่อช่วงแสงต้านทานโรคไหม้ และโรคใบสีส้มปานกลาง');
INSERT INTO "RiceRec" VALUES ('R25','กข. 18',1,1,1,0,1,'0','N','เป็นข้าวเจ้าไวต่อช่วงแสง ทนทานดินเค็มได้ดีกว่าพันธุ์ขาวดอกมะลิ 105ไวต่อช่วงแสงความสูงประมาณ 157 เซนติเมตรทรงกอตั้ง ลำต้นค่อนข้างแข็ง ใบสีเขียว ปลายใบตั้งตรง ใบแก่เร็วปานกลางใบธงยาว ปลายใบตั้งตรง');
INSERT INTO "RiceRec" VALUES ('R26','กข. 12',1,1,1,1,1,'0','N','เป็นข้าวเหนียวไวต่อช่วงแสงทรงกอตั้ง   ต้นแข็งไม่ล้มง่าย ใบสีเขียวเข้ม รวงแน่นปานกลาง คอรวงยาว ให้จำนวนรวงเฉลี่ย 10 รวงต่อกอมล็ดข้าวเปลือกสีน้ำตาลเข้ม ขนสั้น');
INSERT INTO "RiceRec" VALUES ('R27','กข. 8',0,0,1,0,0,'1','N','เป็นข้าวเหนียว สูงประมาณ 150 เซนติเมตรไวต่อช่วงแสงลำต้นและใบสีเขียวเข้ม ใบธงตั้ง ฟางแข็ง ชูรวงอยู่เหนือใบ เมล็ดข้าวค่อนข้างป้อม ลำต้นแข็งสีเมล็ดข้าวเปลือก แถบสีน้ำตาลบนพื้นสีฟาง');
INSERT INTO "RiceRec" VALUES ('R28','กข. 2',0,0,0,1,0,'0','A','เป็นข้าวเหนียว สูงประมาณ 115 เซนติเมตรไม่ไวต่อช่วงแสงใบสีเขียว กาบใบสีเขียวอ่อนเมล็ดข้าวเปลือกสีฟางอ่อน');
INSERT INTO "RiceRec" VALUES ('R29','กข. 4',1,1,1,0,0,'1','N,NE','เป็นข้าวเหนียว สูงประมาณ 115 เซนติเมตรไม่ไวต่อช่วงแสงลำต้น กาบใบ และขอบใบสีม่วง เมล็ดยาวเรียวข้าวเปลือกสีน้ำตาลเข้ม');
INSERT INTO "RiceRec" VALUES ('R30','กข. 10',0,0,1,0,0,'1','N,NE','เป็นข้าวเหนียว สูงประมาณ 115 เซนติเมตรไม่ไวต่อช่วงแสงทรงกอตั้งตรง ลำต้นสีเขียวเข้ม ใบค่อนข้างกว้างเมล็ดข้าวเปลือกสีฟาง');
INSERT INTO "RiceRec" VALUES ('R31','กข. 22',1,1,0,1,1,'0','N,NE','เป็นข้าวเหนียวไม่ไวต่อช่วงแสงลักษณะทรงกอตั้ง ความสูงประมาณ 120 เซนติเมตร ลำต้นค่อนข้างแข็ง ใบสีเขียวเข้ม ปลายใบตั้งตรง ใบค่อนข้างแก่ช้า  ลักษณะรวงแน่นปานกลาง คอรวงสั้น');
INSERT INTO "RiceRec" VALUES ('R32','กข. 14',1,1,1,1,1,'0','N','เป็นข้าวเหนียว สูงประมาณ 105-120 เซนติเมตรไม่ไวต่อช่วงแสงทรงกอตั้ง ต้นแข็ง กาบใบและใบมีสีเขียวเมล็ดข้าวเปลือกส่วนใหญ่สีฟางขีดน้ำตาล เปลือกเมล็ดมีขนสั้น');
COMMIT;
